## Terraform Run Output 🤖
    
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

$ terraform validate
Success! The configuration is valid.

```

</details>

#### Plan 📖`success`
* **Plan: 1 to add, 2 to change, 6 to destroy.**

<details><summary>Show Plan</summary>

```

$ terraform plan
Acquiring state lock. This may take a few moments...
local_file.ansible_inventory: Refreshing state... [id=e7b3f71fb68cc29f026b251ba92a9bfe9a6e4fd6]
null_resource.ansible_update_known_hosts: Refreshing state... [id=4418919173081010018]
module.terraform_state_backend.data.aws_region.current: Reading...
aws_route53_record.clickhouse_dns: Refreshing state... [id=Z035992527R8VEIX2UVO0_clickhouse.tier1.prod.ooni.nu_A]
aws_eip.clickhouse_ip: Refreshing state... [id=eipalloc-0f0a20bba4a1d858c]
aws_vpc.main: Refreshing state... [id=vpc-08b101405472a0b46]
module.terraform_state_backend.data.aws_region.current: Read complete after 0s [id=eu-central-1]
data.aws_availability_zones.available: Reading...
aws_security_group.clickhouse_sg: Refreshing state... [id=sg-0c0ffdfe535bededa]
aws_iam_role.ecs_service: Refreshing state... [id=ooni_ecs_role]
aws_volume_attachment.clickhouse_data_volume_attachment: Refreshing state... [id=vai-2291175638]
aws_iam_role.app_instance: Refreshing state... [id=tf-ecs-ooni-instance-role]
aws_cloudwatch_log_group.ecs: Refreshing state... [id=tf-ecs-group/ecs-agent]
aws_instance.clickhouse_server_prod_tier1: Refreshing state... [id=i-0aaa354af74a5e988]
data.aws_ssm_parameter.ecs_optimized_ami: Reading...
aws_cloudwatch_log_group.app: Refreshing state... [id=tf-ecs-group/app-dataapi]
module.terraform_state_backend.aws_s3_bucket.default[0]: Refreshing state... [id=ooni-production-terraform-state]
data.aws_availability_zones.available: Read complete after 0s [id=eu-central-1]
module.terraform_state_backend.aws_dynamodb_table.with_server_side_encryption[0]: Refreshing state... [id=ooni-production-terraform-state-lock]
aws_acm_certificate.dataapi: Refreshing state... [id=arn:aws:acm:eu-central-1:082866812839:certificate/27b7c5e3-ef70-41e8-a6cf-ac0d58a99613]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:082866812839:cluster/ooni-ecs-cluster]
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.terraform_state_backend.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=2050088263]
aws_iam_role_policy.ecs_service: Refreshing state... [id=ooni_ecs_role:ooni_ecs_policy]
aws_iam_instance_profile.app: Refreshing state... [id=tf-ecs-instprofile]
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.terraform_state_backend.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=2050088263]
data.aws_ssm_parameter.ecs_optimized_ami: Read complete after 1s [id=/aws/service/ecs/optimized-ami/amazon-linux-2/recommended]
aws_iam_role_policy.instance: Refreshing state... [id=tf-ecs-ooni-instance-role:TfEcsOONIInstanceRole]
aws_ecs_task_definition.dataapi: Refreshing state... [id=ooni-dataapi-production-td]
aws_route53_record.dataapi_cert_validation["dataapi.prod.ooni.io"]: Refreshing state... [id=Z02418652BOD91LFA5S9X__74a0d0e91f58697b6838bed5a2fb4939.dataapi.prod.ooni.io._CNAME]
aws_acm_certificate_validation.dataapi: Refreshing state... [id=2024-02-05 11:11:01.598 +0000 UTC]
aws_internet_gateway.gw: Refreshing state... [id=igw-05319878d828e0a53]
aws_subnet.main[1]: Refreshing state... [id=subnet-02241f60bd951358d]
aws_alb_target_group.dataapi: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:targetgroup/ooni-ecs-dataapi/c16001d24f858f20]
aws_subnet.main[0]: Refreshing state... [id=subnet-06d47d18b015109d4]
aws_security_group.pg_sg: Refreshing state... [id=sg-06d7cf832e6855a37]
aws_security_group.lb_sg: Refreshing state... [id=sg-090ff83a71e7ad235]
aws_route_table.r: Refreshing state... [id=rtb-06814accd93aca9ce]
aws_security_group.instance_sg: Refreshing state... [id=sg-0f39450a61732d69b]
aws_db_subnet_group.main: Refreshing state... [id=ooni-main]
aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:loadbalancer/app/ooni-alb-ecs/4cf8bd00b53f8961]
aws_route_table_association.a[0]: Refreshing state... [id=rtbassoc-049f8c5e84cb32e55]
aws_route_table_association.a[1]: Refreshing state... [id=rtbassoc-034c4831c1754e284]
aws_launch_template.app: Refreshing state... [id=lt-01b923563af0432b5]
aws_autoscaling_group.app: Refreshing state... [id=ooni-tier1-production-backend-asg20240119184843559900000002]
aws_db_instance.ooni_pg: Refreshing state... [id=db-LT4NDHTMMWPYB4TLALUJMYTZFU]
aws_route53_record.alb_dns: Refreshing state... [id=Z02418652BOD91LFA5S9X_dataapi.prod.ooni.io_A]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-alb-ecs/4cf8bd00b53f8961/1cd9240a34a13129]
aws_alb_listener.front_end_https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:082866812839:listener/app/ooni-alb-ecs/4cf8bd00b53f8961/b7ec77ceadac94c8]
aws_route53_record.postgres_dns: Refreshing state... [id=Z035992527R8VEIX2UVO0_postgres.tier0.prod.ooni.nu_CNAME]
module.terraform_state_backend.aws_s3_bucket_server_side_encryption_configuration.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.aws_s3_bucket_versioning.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.aws_s3_bucket_policy.default[0]: Refreshing state... [id=ooni-production-terraform-state]
module.terraform_state_backend.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2024-02-02T21:32:23Z]
module.terraform_state_backend.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=ooni-production-terraform-state]
aws_ecs_service.dataapi: Refreshing state... [id=arn:aws:ecs:eu-central-1:082866812839:service/ooni-ecs-cluster/ooni-ecs-dataapi-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.dataapi will be updated in-place
  ~ resource "aws_ecs_service" "dataapi" {
        id                                 = "arn:aws:ecs:eu-central-1:082866812839:service/ooni-ecs-cluster/ooni-ecs-dataapi-production"
        name                               = "ooni-ecs-dataapi-production"
        tags                               = {
            "Name"       = "ooni-tier1-production"
            "Repository" = "https://github.com/ooni/devops"
        }
      ~ triggers                           = {
          ~ "redeployment" = "2024-02-15T09:26:42Z" -> "2024-02-23T10:40:26Z"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_eip.clickhouse_ip will be destroyed
  # (because aws_eip.clickhouse_ip is not in configuration)
  - resource "aws_eip" "clickhouse_ip" {
      - allocation_id        = "eipalloc-0f0a20bba4a1d858c" -> null
      - association_id       = "eipassoc-0df5811601ca90233" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0f0a20bba4a1d858c" -> null
      - instance             = "i-0aaa354af74a5e988" -> null
      - network_border_group = "eu-central-1" -> null
      - network_interface    = "eni-00f22a56186e795ab" -> null
      - private_dns          = "ip-10-0-0-118.eu-central-1.compute.internal" -> null
      - private_ip           = "10.0.0.118" -> null
      - public_dns           = "ec2-3-65-139-104.eu-central-1.compute.amazonaws.com" -> null
      - public_ip            = "3.65.139.104" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - tags_all             = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - vpc                  = true -> null
    }

  # aws_instance.clickhouse_server_prod_tier1 will be destroyed
  # (because aws_instance.clickhouse_server_prod_tier1 is not in configuration)
  - resource "aws_instance" "clickhouse_server_prod_tier1" {
      - ami                                  = "ami-0e626c31414223120" -> null
      - arn                                  = "arn:aws:ec2:eu-central-1:082866812839:instance/i-0aaa354af74a5e988" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-central-1a" -> null
      - cpu_core_count                       = 2 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0aaa354af74a5e988" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "r5.xlarge" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "ooni-devops-prod" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-00f22a56186e795ab" -> null
      - private_dns                          = "ip-10-0-0-118.eu-central-1.compute.internal" -> null
      - private_ip                           = "10.0.0.118" -> null
      - public_dns                           = "ec2-3-65-139-104.eu-central-1.compute.amazonaws.com" -> null
      - public_ip                            = "3.65.139.104" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-06d47d18b015109d4" -> null
      - tags                                 = {
          - "Name"       = "clickhouse-ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - tags_all                             = {
          - "Name"       = "clickhouse-ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = (sensitive value) -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0c0ffdfe535bededa",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 2 -> null
        }

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {
              - "Name"       = "ooni-tier1-prod-clickhouse-vol1"
              - "Repository" = "https://github.com/ooni/devops"
            } -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0753909d310ed6d8d" -> null
          - volume_size           = 1024 -> null
          - volume_type           = "gp3" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0af7fc3c930dfca19" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_launch_template.app will be updated in-place
  ~ resource "aws_launch_template" "app" {
      ~ default_version                      = 9 -> (known after apply)
        id                                   = "lt-01b923563af0432b5"
      ~ image_id                             = (sensitive value)
      ~ latest_version                       = 9 -> (known after apply)
        name                                 = "ooni-tier1-production-backend-lt20240120072522124000000001"
        tags                                 = {}
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.clickhouse_dns will be destroyed
  # (because aws_route53_record.clickhouse_dns is not in configuration)
  - resource "aws_route53_record" "clickhouse_dns" {
      - fqdn                             = "clickhouse.tier1.prod.ooni.nu" -> null
      - id                               = "Z035992527R8VEIX2UVO0_clickhouse.tier1.prod.ooni.nu_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "clickhouse.tier1.prod.ooni.nu" -> null
      - records                          = [
          - "3.65.139.104",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z035992527R8VEIX2UVO0" -> null
    }

  # aws_security_group.clickhouse_sg will be destroyed
  # (because aws_security_group.clickhouse_sg is not in configuration)
  - resource "aws_security_group" "clickhouse_sg" {
      - arn                    = "arn:aws:ec2:eu-central-1:082866812839:security-group/sg-0c0ffdfe535bededa" -> null
      - description            = "Allow Clickhouse traffic" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0c0ffdfe535bededa" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "93.65.174.0/24",
                ]
              - description      = ""
              - from_port        = 8123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8123
            },
        ] -> null
      - name                   = "clickhouse_sg" -> null
      - owner_id               = "082866812839" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - tags_all               = {
          - "Name"       = "ooni-tier1-production"
          - "Repository" = "https://github.com/ooni/devops"
        } -> null
      - vpc_id                 = "vpc-08b101405472a0b46" -> null
    }

  # aws_volume_attachment.clickhouse_data_volume_attachment will be destroyed
  # (because aws_volume_attachment.clickhouse_data_volume_attachment is not in configuration)
  - resource "aws_volume_attachment" "clickhouse_data_volume_attachment" {
      - device_name  = "/dev/sdf" -> null
      - force_detach = true -> null
      - id           = "vai-2291175638" -> null
      - instance_id  = "i-0aaa354af74a5e988" -> null
      - volume_id    = "vol-0753909d310ed6d8d" -> null
    }

  # local_file.ansible_inventory must be replaced
-/+ resource "local_file" "ansible_inventory" {
      ~ content              = <<-EOT # forces replacement
            # Do not edit!
            # autogenerated by terraform in ooni/devops
            [all]
          - clickhouse.tier1.prod.ooni.nu
            
            [clickhouse_servers]
          - clickhouse.tier1.prod.ooni.nu
        EOT
      ~ content_base64sha256 = "Exh5BF7SEcaY19excuARRsBbf00r+dKBpb/69YoyxaU=" -> (known after apply)
      ~ content_base64sha512 = "AATIWx3UPPhRrTTc6zyLWwgRFW2By0c5ha0t08N/561MIw3KZiYZNj1rWX0vnOuk8CHRgI/D4BRbvpSfggjF5Q==" -> (known after apply)
      ~ content_md5          = "484c3a81c295e50a7919dd86653425ca" -> (known after apply)
      ~ content_sha1         = "e7b3f71fb68cc29f026b251ba92a9bfe9a6e4fd6" -> (known after apply)
      ~ content_sha256       = "131879045ed211c698d7d7b172e01146c05b7f4d2bf9d281a5bffaf58a32c5a5" -> (known after apply)
      ~ content_sha512       = "0004c85b1dd43cf851ad34dceb3c8b5b0811156d81cb473985ad2dd3c37fe7ad4c230dca662619363d6b597d2f9ceba4f021d1808fc3e0145bbe949f8208c5e5" -> (known after apply)
      ~ id                   = "e7b3f71fb68cc29f026b251ba92a9bfe9a6e4fd6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

|                   |                                    |
|-------------------|------------------------------------|
| Pusher            | @hellais               |
| Action            |  pull_request          |
| Working Directory |  ./tf/environments/prod |
| Workflow          |  .github/workflows/check_deploy.yml            |
| Last updated      |  Fri, 23 Feb 2024 10:40:33 GMT   |

    